In [1]:
# Q1. Count all letters, digits, and special symbols from a given string
# str1 = "I@#ma26rt^&ic5us"
str1 = "I@#ma26rt^&ic5us"
letters = 0
digits = 0 
special_sym = 0
for i in str1:
    if i.isalpha():
        letters+=1
    elif i.isdigit():
        digits+=1
    else:
        special_sym+=1
print(f"No. of letters is {letters}")
print(f"No. of digits is {digits}")
print(f"No. of special_sym is {special_sym}")

No. of letters is 9
No. of digits is 3
No. of special_sym is 4

In [11]:
# Q.2 Write a Python program to find numbers divisible by nineteen or thirteen from a list of numbers using Lambda.
a=[19, 65, 57, 39, 152, 639, 121, 44, 90, 190]
list(filter(lambda c:c%19==0 or c%13==0,a))

[19, 65, 57, 39, 152, 190]

In [35]:
#Q3. Find all of the words in a string that are less than 5 letters.
x = "Practice Problems to Drill List Comprehension in Your Head."
y=x.split()
a= []
for i in y:
    if len(i)<5:
        a.append(i)
print("words less than 5 letters are ", a)

words less than 5 letters are  ['to', 'List', 'in', 'Your']

In [41]:
b = [i for i in y if len(i)<5] # using list comprehension
print("words less than 5 letters are ",b)

words less than 5 letters are  ['to', 'List', 'in', 'Your']

In [59]:
# Q4.Calculate income tax for the given income by adhering to the below rules:
income = int(input("enter your income : "))
if income <= 10000:
        tax = 0
elif income <= 20000:
    tax = (income - 10000) * 0.1
else:
    tax = (10000 * 0.1) + ((income - 20000) * 0.2)
print(f"tax on ${income} is ${tax:.2f}")

enter your income :  45000

tax on $45000 is $6000.00

In [65]:
#Q5 Given below are the list of positive and negative words.
#Also, a list of tweets is provided. Separate out the positive and negative comments.
positive = ['good','awesome', 'best', 'nice']
negative = ['worst','awful', 'bad']
tweets = ['This government policies are good', 'bad implementation', 
          'The way he played showed that he is one of the best players in the world',
          'Her acting in the play was awesome', 'The wine tastes awful',
          "It's nice to hear this little kid's laugh"]

In [83]:
positive_comments = []
negative_comments = []

for i in tweets:
    if any(word in i for word in positive):
        positive_comments.append(i)
    elif any(word in i for word in negative):
        negative_comments.append(i)

In [89]:
print("Positive comments:")
for comment in positive_comments:
    print(f"- {comment}")

print("Negative comments:")
for comment in negative_comments:
    print(f"- {comment}")

Positive comments:
- This government policies are good
- The way he played showed that he is one of the best players in the world
- Her acting in the play was awesome
- It's nice to hear this little kid's laugh
Negative comments:
- bad implementation
- The wine tastes awful

In [117]:
#Q.6 Extend nested list by adding the sublist.
# You have given a nested list. Write a program to extend it by adding the sublist ["h", "i", "j"] in such a way that it will look
list1 = ["a", "b", ["c", ["d", "e", ["f", "g"], "k"], "l"], "m", "n"]
sub_list = ["h", "i", "j"]
list1[2][1][2].extend(["h", "i", "j"])
print(list1)

['a', 'b', ['c', ['d', 'e', ['f', 'g', 'h', 'i', 'j'], 'k'], 'l'], 'm', 'n']

In [123]:
# Q.7 Remove and add item in a list.
# Write a program to remove the item present at index 4 and add it to the 2nd position and at the end of the list.
list1 = [54, 44, 27, 79, 91, 41]
a = list1.pop(4)
list1.insert(1,a)
list1.append(a)

In [125]:
list1

[54, 91, 44, 27, 79, 41, 91]

In [127]:
# Q.8 Load the iris dataset and Find only those records whose sepal_length = 5.1 and sepal_width = 3.5
import seaborn as sns

In [129]:
sns.get_dataset_names()

['anagrams',
 'anscombe',
 'attention',
 'brain_networks',
 'car_crashes',
 'diamonds',
 'dots',
 'dowjones',
 'exercise',
 'flights',
 'fmri',
 'geyser',
 'glue',
 'healthexp',
 'iris',
 'mpg',
 'penguins',
 'planets',
 'seaice',
 'taxis',
 'tips',
 'titanic']

In [133]:
iris = sns.load_dataset("iris")
iris

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [137]:
iris.loc[(iris["sepal_length"]==5.1) & (iris["sepal_width"]==3.5)]

    sepal_length  sepal_width  petal_length  petal_width species
0            5.1          3.5           1.4          0.2  setosa
17           5.1          3.5           1.4          0.3  setosa

In [151]:
# Q.9 Check for Maximum petal_length and convert it in to 7.2 and min petal_length and convert it in to 1.2
iris.loc[(iris["sepal_length"]==iris["petal_length"].max())]= 7.2

In [153]:
iris.loc[(iris["sepal_length"]==iris["petal_length"].min())]= 1.2

In [155]:
iris["petal_length"].max()

7.2

In [157]:
iris["petal_length"].min()

1.0

In [159]:
# Q.10 Perform right join to combine values based on the 'ID' in the two dataframes.
# Use the dataframe given below, read the DataFrame with the help of clipboard function
import pandas as pd

In [173]:
df1 = pd.read_clipboard()

In [175]:
df1

    ID Candidate_Name    Subject
0  101           Alex    History
1  102            Amy    English
2  103          Allen  Geography
3  104          Alice     German
4  105          James    History
5  106           Sara     German
6  107            Mia    English

In [167]:
df2 = pd.read_clipboard()

In [169]:
df2

    ID       City  Subject_Score
0  101      Delhi             89
1  102     Mumbai             78
2  103      Delhi             77
3  104    Chennai             87
4  105  Hyderabad             87
5  108      Delhi             84

In [177]:
new = pd.merge(df1, df2, on='ID', how='right')
new

    ID Candidate_Name    Subject       City  Subject_Score
0  101           Alex    History      Delhi             89
1  102            Amy    English     Mumbai             78
2  103          Allen  Geography      Delhi             77
3  104          Alice     German    Chennai             87
4  105          James    History  Hyderabad             87
5  108            NaN        NaN      Delhi             84